Application/Module 2/Work in Progress/SM Scholarship Foundation/backend/views/scholars/_form.php

    <?= $form->field($model, 'scholar_address')->textInput(['maxlength' => true]) ?>

	<?= $form->field($model,'scholar_school_id')->widget(Select2::classname(),
		[
			'data'=>ArrayHelper::map(Schools::find()->all(),'School_id','school_name'),
			'language'=>'en',
			'options'=>['placeholder'=>'Select School Name'],
			'pluginOptions'=>['allowClear'=>true],
		]) ?>
---
SELECT * FROM `schools`