Application/Module 2/Work in Progress/SM Scholarship Foundation/backend/views/scholars/index.php

SELECT * FROM `schools` WHERE `School_id` IN (1, 2, 3, 4, 5)
---
					'widgetClass'=> 'kartik\select2\Select2',
				],
			],
            [
				'class' => 'kartik\grid\EditableColumn',
            	'attribute'=>'scholar_school_id',
				'editableOptions' => [
					'inputType' => '\kartik\select2\Select2',
					'options'=>
					[
						'data' => ArrayHelper::map(Schools::find()->all(),'School_id','school_name'),
					],
				],
            	'value'=>'scholarSchool.school_name',
            ],