Application/Module 2/Work in Progress/SM Scholarship Foundation/backend/views/grades/index.php

				'detail' => function ($model, $key, $index, $column){
					$searchModel = new GradesSearch();
					$searchModel -> grade_scholar_id = $model->scholar_id;
					$dataProvider = $searchModel->search(Yii::$app->request->queryParams);
---
SELECT * FROM `scholars` WHERE `scholar_id` IN (2, 3)